"""
4. Вывести на консоль своё имя, нарисованное 'звёздочками'. Для выполнения этого задания надо использовать не только
символы звёздочки и пробела, но и ESCAPE символы: \n и \t
"""

# Выводим MAX
print()
name = "\t**     **\t    **    \t*        *\n" \
       "\t* *   * *\t   *  *   \t  *    *\n" \
       "\t*   *   *\t  ******  \t    **\n" \
       "\t*       *\t *      * \t  *    *\n" \
       "\t*       *\t*        *\t*        *"
print(name)
print()
print("MAX")
